НВ_Доработки/Documents/ЗаявкаНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаявкаНаДоставку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НВД_КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплачиваетПолучатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоставленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВодительЗаберетГрузСамостоятельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявокНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_Основание</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоставленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_ТелефонВодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтветственныйЗаДоставку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаЗатратНаДоставку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТелефонКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленEMail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидТранспортногоСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

НВ_Доработки/Documents/ЗаявкаНаДоставку/Ext/ManagerModule.bsl
&Вместо("ПолучитьДанныеДляПечатныхФорм")
Функция НВД_ПолучитьДанныеДляПечатныхФорм(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкаНаДоставку.Ссылка КАК Ссылка,
	|	""01.01.2017"" КАК Дата,
	|	""01.01.2017"" КАК ДатаОснования,
	|	ЗаявкаНаДоставку.ВерсияДанных КАК ВерсияДанных,
	|	ЗаявкаНаДоставку.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗаявкаНаДоставку.Номер КАК Номер,
	|	ЗаявкаНаДоставку.Дата КАК ДатаДокумента,
	|	ЗаявкаНаДоставку.Проведен КАК Проведен,
	|	ЗаявкаНаДоставку.СпособДоставки КАК СпособДоставки,
	|	ЗаявкаНаДоставку.АдресДоставки КАК АдресДоставки,
	|	ЗаявкаНаДоставку.Результат КАК ТекущийСтатус,
	|	ЗаявкаНаДоставку.ОтветственныйЗаДоставку КАК ОтветственныйЗаДоставку,
	|	ЗаявкаНаДоставку.Организация КАК Организация,
	|	ЗаявкаНаДоставку.Автор КАК Автор,
	|	ЗаявкаНаДоставку.Комментарий КАК Комментарий,
	|	ЗаявкаНаДоставку.Экспедитор КАК Экспедитор,
	|	ЗаявкаНаДоставку.Получатель КАК Получатель,
	|	ВЫБОР
	|		КОГДА НЕ ЗаявкаНаДоставку.Получатель.НаименованиеПолное = """"
	|			ТОГДА ЗаявкаНаДоставку.Получатель.НаименованиеПолное
	|		ИНАЧЕ ЗаявкаНаДоставку.Получатель.Наименование
	|	КОНЕЦ КАК Контрагент,
	|	ЗаявкаНаДоставку.ОжидаемаяДатаДоставки КАК ОжидаемаяДатаДоставки,
	|	ЗаявкаНаДоставку.ОжидаемаяДатаОтправки КАК ОжидаемаяДатаОтправки,
	|	ЗаявкаНаДоставку.ОплачиваетПолучатель КАК ОплачиваетПолучатель,
	|	ЗаявкаНаДоставку.СтоимостьДоставки КАК СтоимостьДоставки,
	|	ЗаявкаНаДоставку.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ЗаявкаНаДоставку.Валюта КАК Валюта,
	|	ЗаявкаНаДоставку.ОтправленEMail КАК ОтправленEMail,
	|	ЗаявкаНаДоставку.УДАЛИТЬ_ОтправленоСМС КАК УДАЛИТЬ_ОтправленоСМС,
	|	ЗаявкаНаДоставку.НомерОтправления КАК НомерОтправления,
	|	ЗаявкаНаДоставку.авто_Модель КАК авто_Модель,
	|	ЗаявкаНаДоставку.авто_Марка КАК авто_Марка,
	|	ЗаявкаНаДоставку.авто_ГосНомер КАК авто_ГосНомер,
	|	ЗаявкаНаДоставку.авто_Водитель КАК авто_Водитель,
	|	ЗаявкаНаДоставку.авто_ТелефонВодителя КАК авто_ТелефонВодителя,
	|	ЗаявкаНаДоставку.ВодительЗаберетГрузСамостоятельно КАК ВодительЗаберетГрузСамостоятельно,
	|	ЗаявкаНаДоставку.ОтправленоДата КАК ОтправленоДата,
	|	ЗаявкаНаДоставку.ОтправленоОтветственный КАК ОтправленоОтветственный,
	|	ЗаявкаНаДоставку.ДоставленоДата КАК ДоставленоДата,
	|	ЗаявкаНаДоставку.ДоставленоОтветственный КАК ДоставленоОтветственный,
	|	ЗаявкаНаДоставку.НВД_КонтактноеЛицо КАК КонтактноеЛицо,
	|	ЗаявкаНаДоставку.ТелефонКонтактногоЛица КАК ТелефонКонтактногоЛицаИзДокумента,
	|	КонтактныеЛицаКонтактнаяИнформация.НомерТелефона КАК ТелефонКонтактногоЛица,
	|	ЕСТЬNULL(ЗаявкаНаДоставку.Город, """") КАК Город
	|ИЗ
	|	Документ.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	|		ПО (ЗаявкаНаДоставку.НВД_КонтактноеЛицо = КонтактныеЛицаКонтактнаяИнформация.Ссылка
	|				И КонтактныеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И КонтактныеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица))
	|ГДЕ
	|	ЗаявкаНаДоставку.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявкаНаДоставку.Ссылка,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура.Артикул КАК Артикул,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Основание КАК Основание
	|ИЗ
	|	Документ.ЗаявкаНаДоставку.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиТовары = МассивРезультатов[1];

	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиТовары",
	РезультатПоШапке, РезультатПоТабличнойЧастиТовары);

	Возврат СтруктураДанныхДляПечати;

КонецФункции

&Вместо("ПечатьНакладнаяНаДоставку")
Функция НВД_ПечатьНакладнаяНаДоставку(МассивОбъектов, ОбъектыПечати)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_НакладнаяНаДоставку";  
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявкаНаДоставку.ПФ_MXL_НакладнаяИЗМ");
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();

	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();	
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);

	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
				
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("КонтактноеЛицо");
			Если ЗначениеЗаполнено(ДанныеПечати.ТелефонКонтактногоЛицаИзДокумента) Тогда
				ОбластьМакета.Параметры.ТелефонКонтактногоЛица = ДанныеПечати.ТелефонКонтактногоЛицаИзДокумента;
			Иначе
				ОбластьМакета.Параметры.ТелефонКонтактногоЛица = ДанныеПечати.ТелефонКонтактногоЛица;
			КонецЕсли;
			ОбластьМакета.Параметры.КонтактноеЛицо = ДанныеПечати.КонтактноеЛицо;
			//ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ОжидаемаяДатаДоставки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;
		
		//++ №10663 комментируем, т.к. основание теперь нужно выводить в колонке ТЧ "Товары"
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("Основание");
		//	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение			
		//КонецПопытки;
		//-- №10663

		//добавим адрес доставки, если поле не пустое
		Попытка
			Если не ПустаяСтрока(ДанныеПечати.АдресДоставки) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("АдресДоставки");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение			
		КонецПопытки;
		
		Если ДанныеПечати.СпособДоставки = Справочники.СпособыДоставкиТовара.Автобус
			или ДанныеПечати.СпособДоставки = Справочники.СпособыДоставкиТовара.ПопутныйАвтомобиль Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("Автобус");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение			
			КонецПопытки;
		ИначеЕсли ДанныеПечати.СпособДоставки = Справочники.СпособыДоставкиТовара.СобственныйТранспорт Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("СобственныйТранспорт");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение			
			КонецПопытки;
		ИначеЕсли ДанныеПечати.СпособДоставки = Справочники.СпособыДоставкиТовара.ТранспортнаяКомпания Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ТранспортнаяКомпания");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение			
			КонецПопытки;
		КонецЕсли;

		// Изменения размера колоноки, в зависимости от вывода Артикула
		Если Не ВыводитьАртикул Тогда
			Попытка
				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
			Исключение
			КонецПопытки;
		КонецЕсли;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);

			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;

			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение			
		КонецПопытки;		

		Сумма = 0;
		Количество = 0;
		НомерСтроки = 1;

		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоТоварам.Сбросить();
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();

			Пока Выборка.Следующий() Цикл

				Попытка					
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					ТабличныйДокумент.Вывести(ОбластьМакета);

					Если ВыводитьАртикул Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Выборка);
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;

					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ОбластьМакета.Параметры.Заполнить(Выборка);

					//++ №12909
					//ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
					ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры);;
					//-- №12909

					ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;

					//++ №10663 выводим основание из колонки в виде [ВидДокумента] [НомерДокументаНаПечать] от [ДатаДокумента]
					Попытка
						ОбластьМакета.Параметры.Основание = СтрШаблон("%1 №%2 от %3"
						, Выборка.Основание.Метаданные().Синоним
						, ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Основание.Номер)
						, Формат(Выборка.Основание.Дата, "ДЛФ=Д")
						);
					Исключение
					КонецПопытки;
					//-- №10663

					ТабличныйДокумент.Присоединить(ОбластьМакета);

					НомерСтроки = НомерСтроки + 1;			
					Количество = Количество + Выборка.Количество;
					Сумма = Сумма + Выборка.Сумма;

				Исключение			
				КонецПопытки;		
			КонецЦикла;
		КонецЕсли;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Итого|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);

			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Итого|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;

			ОбластьМакета = Макет.ПолучитьОбласть("Итого|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				ОбластьМакета.Параметры.Отпустил = ОбщийМодуль.ФамилияИнициалы(ДанныеПечати.Организация.Руководитель.Наименование);									
			Исключение			
			КонецПопытки; 
			Попытка
				ОбластьМакета.Параметры.Количество = Количество;						
			Исключение			
			КонецПопытки;
			Попытка		
				ОбластьМакета.Параметры.Сумма = Сумма;			
			Исключение			
			КонецПопытки;		

			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение			
		КонецПопытки;

		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение			
		КонецПопытки;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	КонецЦикла;

	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;

	Возврат ТабличныйДокумент;


КонецФункции
